#include <iostream>

using namespace std;

double mixed_product(double x[3], double y[3], double z[3]) //функция считающая смешанное произведение, в качестве аргументов принмает три вектора представленных в виде масисива с длиной 3
{
    return x[0] * ((y[1] * z[2]) - (y[2] * z[1])) - x[1] * ((y[0] * z[2]) - (y[2] * z[0])) + x[2] * ((y[0] * z[1]) - (y[1] * z[0]));//рассчет определителя матрицы 3х3
}
int main()
{
    double a[3] = {1, 2 ,3};    //вектор 1
    double b[3] = {11, 23 ,46}; //вектор 2
    double c[3] = {-41, 0 , 4.213};    //вектор 3
    cout<<mixed_product(a, b, c); //вызываем функцию смешанного произведения и выводим на экран значение которое она возвращает

    return 0;
}
